<a href="https://colab.research.google.com/github/leesangh92/pandas/blob/main/(21_5_20).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# (큰 글씨) 21.5.20
## (작은 글씨) colab 기초 사용법

내용

In [ ]:
!ls

In [ ]:
!pwd # print working directory (현재 위치 확인)

In [ ]:
!%history

In [4]:
import platform

In [ ]:
platform.platform()

In [ ]:
!nl /etc/issue/net

In [ ]:
!nl /proc/cpuinfo

In [ ]:
!nl /proc/meminfo

In [ ]:
!df -h ## disc free, /dev/sda1 -HDD

In [1]:
from google.colab import drive

In [2]:
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
!df -h # /content/drive 경로 확인

Filesystem      Size  Used Avail Use% Mounted on
overlay         108G   39G   70G  36% /
tmpfs            64M     0   64M   0% /dev
tmpfs           6.4G     0  6.4G   0% /sys/fs/cgroup
shm             5.9G     0  5.9G   0% /dev/shm
tmpfs           6.4G   24K  6.4G   1% /var/colab
/dev/sda1       114G   41G   74G  36% /etc/hosts
tmpfs           6.4G     0  6.4G   0% /proc/acpi
tmpfs           6.4G     0  6.4G   0% /proc/scsi
tmpfs           6.4G     0  6.4G   0% /sys/firmware
drive            15G  665M   15G   5% /content/drive

In [ ]:
!cat ss.xlsx

엑셀 파일 읽기

In [5]:
import pandas as pd

In [6]:
pd1 = pd.read_excel('/content/ss.xlsx')

**bold**

__bold__

*italic*

--cancel--

<u>underline</u>

[google](http://google.com)

[youtube](http://youtube.com)

![link](link)

In [9]:
%history

from google.colab import drive
drive.mount('/content/drive')
!df -h ## disc free, /dev/sda1 -HDD
!df -h
import pandas as pd
pd1 = pd.read_excel('/content/ss.xlsx')
!cat ss.xlsx
!%history
%history

In [10]:
!ls

drive  sample_data  ss.txt  ss.xlsx

In [11]:
!cat -n ss.txt

     1	이순신 85 87 90
     2	강감찬 75 80 95
     3	한석봉 99 98 99
     4	황진이 35 45 20
     5	안중근 90 85 90
     6	박문수 95 98 96
     7	임꺽정 15 35 45
     8	김정호 90 95 80
     9	정몽주 90 90 95
    10	양주종 50 45 60

In [12]:
!cat ss.txt

이순신 85 87 90
강감찬 75 80 95
한석봉 99 98 99
황진이 35 45 20
안중근 90 85 90
박문수 95 98 96
임꺽정 15 35 45
김정호 90 95 80
정몽주 90 90 95
양주종 50 45 60

In [27]:
pd1 = pd.read_csv('/content/ss.txt')

In [28]:
pd1

   이순신 85 87 90
0  강감찬 75 80 95
1  한석봉 99 98 99
2  황진이 35 45 20
3  안중근 90 85 90
4  박문수 95 98 96
5  임꺽정 15 35 45
6  김정호 90 95 80
7  정몽주 90 90 95
8  양주종 50 45 60

In [30]:
d2 = pd.read_csv('/content/sc.csv', encoding='cp949')

In [31]:
d2

   이순신 85 87 90
0  강감찬 75 80 95
1  한석봉 99 98 99
2  황진이 35 45 20
3  안중근 90 85 90
4  박문수 95 98 96
5  임꺽정 15 35 45
6  김정호 90 95 80
7  정몽주 90 90 95
8  양주종 50 45 60

In [42]:
d3 = pd.read_excel('/content/se.xlsx', names = ['이름', '국어', '영어', '수학'])

In [43]:
d3

    이름  국어  영어  수학
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  양주종  50  45  60

In [34]:
d = d3.copy()

In [35]:
d

   이순신  85  87  90
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  양주종  50  45  60

In [ ]:
dir(d)

In [38]:
type(d)

pandas.core.frame.DataFrame

In [39]:
d.shape

(9, 4)

In [44]:
d.ndim

2

In [45]:
d.size

36

In [47]:
d.items

<bound method DataFrame.items of    이순신  85  87  90
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  양주종  50  45  60>

In [49]:
d5 = pd.read_excel('/content/se.xlsx', header = None)

In [50]:
d5.columns = ['이름', '국어', '영어', '수학']

In [51]:
d5

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  양주종  50  45  60

In [52]:
d = d5.copy()

In [53]:
d.head()

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90

In [54]:
d.tail()

    이름  국어  영어  수학
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  양주종  50  45  60

In [55]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      10 non-null     object
 1   국어      10 non-null     int64
 2   영어      10 non-null     int64
 3   수학      10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes

In [57]:
d.describe()

              국어         영어         수학
count  10.000000  10.000000  10.000000
mean   72.400000  75.800000  77.000000
std    28.883675  24.371203  26.670833
min    15.000000  35.000000  20.000000
25%    56.250000  53.750000  65.000000
50%    87.500000  86.000000  90.000000
75%    90.000000  93.750000  95.000000
max    99.000000  98.000000  99.000000

In [58]:
d.index

RangeIndex(start=0, stop=10, step=1)

In [60]:
d['이름']

0    이순신
1    강감찬
2    한석봉
3    황진이
4    안중근
5    박문수
6    임꺽정
7    김정호
8    정몽주
9    양주종
Name: 이름, dtype: object

In [61]:
d[['이름', '영어']]

    이름  영어
0  이순신  87
1  강감찬  80
2  한석봉  98
3  황진이  45
4  안중근  85
5  박문수  98
6  임꺽정  35
7  김정호  95
8  정몽주  90
9  양주종  45

In [ ]:
d[0]

In [65]:
d.loc[0] # indexing

이름    이순신
국어     85
영어     87
수학     90
Name: 0, dtype: object

In [66]:
d.loc[3]

이름    황진이
국어     35
영어     45
수학     20
Name: 3, dtype: object

In [67]:
d.loc[3:6]

    이름  국어  영어  수학
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45

In [68]:
d[:]

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  양주종  50  45  60

In [71]:
d[: :2] # [ start, end, step ]

    이름  국어  영어  수학
0  이순신  85  87  90
2  한석봉  99  98  99
4  안중근  90  85  90
6  임꺽정  15  35  45
8  정몽주  90  90  95

In [72]:
d.loc[2:3, ['영어', '수학']]

   영어  수학
2  98  99
3  45  20

In [73]:
d.loc[5:9]

    이름  국어  영어  수학
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  양주종  50  45  60

In [74]:
d.loc[::-1]

    이름  국어  영어  수학
9  양주종  50  45  60
8  정몽주  90  90  95
7  김정호  90  95  80
6  임꺽정  15  35  45
5  박문수  95  98  96
4  안중근  90  85  90
3  황진이  35  45  20
2  한석봉  99  98  99
1  강감찬  75  80  95
0  이순신  85  87  90

In [76]:
d.loc[2:8:3]

    이름  국어  영어  수학
2  한석봉  99  98  99
5  박문수  95  98  96
8  정몽주  90  90  95

In [79]:
d.loc[:, ['수학', '영어']]

   수학  영어
0  90  87
1  95  80
2  99  98
3  20  45
4  90  85
5  96  98
6  45  35
7  80  95
8  95  90
9  60  45

In [80]:
d.loc[:, :]

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  양주종  50  45  60

In [81]:
d[3][2]

KeyError: ignored

In [82]:
d.loc[3][2]

45